<?php
/*-------------------------------------------------------
*
*   LiveStreet Engine Social Networking
*   Сделано руками @ Сергей Сарафанов (sersar)
*   ICQ: 172440790 | E-mail: sersar@ukr.net
*
*--------------------------------------------------------
*
*   Official site: www.livestreet.ru
*   Contact e-mail: rus.engine@gmail.com
*
*   GNU General Public License, version 2:
*   http://www.gnu.org/licenses/old-licenses/gpl-2.0.html
*
---------------------------------------------------------
*/

return array(
    'ignore' => 'Игнор',
    
    'copyright' => 'Данный <b>плагин</b> распространяется как <b>платный</b>. Если Вы скачали его без оплаты - просьба связаться с автором: Сергей Сарафанов (sersar), ICQ: 172440790, E-mail: sersar@ukr.net.
<br /><br />При использовании свободно скачанного плагина я не гарантирую работоспособность!<br /><br />Просьба не выкладывать плагин в паблик!<br /><br />Спасибо! Кто купив плагин тем самым оценил работу!<br /><br />',

    'ignore_post_me_pm' => 'Запрет получения личных сообщений от пользователя',
    'ignore_hide_me_comments' => 'Не показывать комментарии пользователя',
    'ignore_reply_my_comment' => 'Запрет пользователю отвечать на мой комментарий',
    'ignore_post_comment_my_topic' => 'Запрет пользователю комментировать мои топики',
    'ignore_post_my_wall' => 'Запрет пользователю писать на моей стене',
    'ignore_hide_me_topics' => 'Запрет показа топиков пользователя (в блоке прямой эфир)',
    'ignore_profile_show' => 'Показать данного пользователя в списке игнорируемых в моём профиле для всех:',
    'ignore_comment_rating' => 'Показать игнорируемый комментарий, если его рейтинг равен или больше заданного числа (0 - скрывать все):',
    
    'submit_apply' => 'Применить',
    
    'settings' => 'Настройки игнора',
    'yes' => 'Да',
    'no' => 'Нет',
    
    'reason' => 'Причина',
    'reason_null' => 'Причина (не обязательно):',
    
    'user_ignore_to' => 'Игнорирует',
    'user_ignore_from' => 'Игнорируют',
    'user_ignore_i' => 'Игнорирую',
    
    'target_form_title' => 'Настройки игнора',
    'target_form_login' => 'Введите логин пользователя:',
    'target_form_reply_my_comment' => 'Запрет пользователю отвечать на мой комментарий в текущем топике',
    'target_form_post_my_topic' => 'Запрет пользователю комментировать текущий топик',
    'target_form_submit' => 'Применить',
    'target_block_user' => 'пользователей игнорируется',
    
    'notice_add_user_ignore' => 'Пользователь добавлен в игнор',
    'notice_update_user_ignore' => 'Настройки пользователя обновлены',
    'notice_delete_user_ignore' => 'Пользователь удалён из игнора',
    
    'js_ignore_block_comments' => 'комментариев игнорируется',
    'js_ignore_post_my_wall' => 'Пользователь запретил Вам писать на стене',
    'js_ignore_reply_my_comment' => 'Пользователь запретил Вам отвечать на комментарий',
    'js_ignore_hide_me_comments' => 'Комментарий в игноре',
    'js_ignore_post_comment_my_topic' => 'Пользователь запретил Вам комментировать',
);
            
















?>