<?php
/*
  Delayed post plugin
  (P) Rafrica.net Studio, 2010 - 2012
  http://we.rafrica.net/
*/

$config = array ();

// ---

// Разрешать ли обычным пользователям выставлять дату публикации
// По умолчанию использовать установку даты могут только администраторы
$config ['UserAllowed'] = true;

// Значения дат, изменять нет смысла

$config ['PossibleYears'] = array ('Текущего года' => date ("Y"),
                                   'Следующего года' => date ("Y") + 1,
                                   );
                                   
$config ['PossibleMonths'] = array ('Января' => '01',
                                   'Февраля' => '02',
                                   'Марта' => '03',
                                   'Апреля' => '04',
                                   'Мая' => '05',
                                   'Июня' => '06',
                                   'Июля' => '07',
                                   'Августа' => '08',
                                   'Сентября' => '09',
                                   'Октября' => '10',
                                   'Ноября' => '11',
                                   'Декабря' => '12',
                                   );
                                   

$config ['PossibleDays'] = array ('01' => '01',
                                  '02' => '02',
                                  '03' => '03',
                                  '04' => '04',
                                  '05' => '05',
                                  '06' => '06',
                                  '07' => '07',
                                  '08' => '08',
                                  '09' => '09',
                                  '10' => '10',
                                  '11' => '11',
                                  '12' => '12',
                                  '13' => '13',
                                  '14' => '14',
                                  '15' => '15',
                                  '16' => '16',
                                  '17' => '17',
                                  '18' => '18',
                                  '19' => '19',
                                  '20' => '20',
                                  '21' => '21',
                                  '22' => '22',
                                  '23' => '23',
                                  '24' => '24',
                                  '25' => '25',
                                  '26' => '26',
                                  '27' => '27',
                                  '28' => '28',
                                  '29' => '29',
                                  '30' => '30',
                                  '31' => '31',
                                  );
                                  
$config ['TimeHours'] = array ('00', '01', '02', '03', '04', '05', '06', '07', '08', '09', '10', '11',
                               '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23');

$config ['TimeMinutes'] = array ('00', '01', '02', '03', '04', '05', '06', '07', '08', '09', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19',
                                 '20', '21', '22', '23', '24', '25', '26', '27', '28', '29', '30', '31', '32', '33', '34', '35', '36', '37', '38', '39',
                                 '40', '41', '42', '43', '44', '45', '46', '47', '48', '49', '50', '51', '52', '53', '54', '55', '56', '57', '58', '59');

// ---

Config::Set('block.rule_topic_delayedpost',array(
	'action'  => array( 
		'link'     	=> array('add','edit'), 
		'question' 	=> array('add','edit'), 
		'topic'    	=> array('add','edit'),
		'photoset'	=> array('add','edit'),	
	),
	'blocks'  => array( 'right' => array('datechange'=>array('params'=>array('plugin'=>'delayedpost'))
	))));
	
$config ['url'] = 'delayedpost';
	
Config::Set ('router.page.' . $config ['url'], 'PluginDelayedpost_ActionDelayedpost');
	
return $config;

?>